Картотека1/src/Documents/трс_ВыбытиеОбъекта/трс_ВыбытиеОбъекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>трс_ВыбытиеОбъекта</name>
  <registerRecords>InformationRegister.трс_ПереходыОбъектовНедвижимости</registerRecords>
  <attributes>
    <name>ПричинаВыбытия</name>
    <type>
      <types>EnumRef.трс_ПричинаВыбытия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>CatalogRef.трс_ДоговорЗалога</types>
      <types>CatalogRef.трс_СитуационныйПлан</types>
      <types>CatalogRef.трс_ДоговорАренды</types>
      <types>CatalogRef.трс_АктПриемаПередачи</types>
      <types>CatalogRef.трс_ПисьмоОрганов</types>
      <types>CatalogRef.трс_ТехническийПлан</types>
      <types>CatalogRef.трс_РазрешениеНаСтроительство</types>
      <types>CatalogRef.трс_СхемаРазмещения</types>
      <types>CatalogRef.трс_Декларация</types>
      <types>CatalogRef.трс_ФайловыйДокумент</types>
      <types>CatalogRef.трс_СправкаОКадастровойСтоимости</types>
      <types>CatalogRef.трс_Справка</types>
      <types>CatalogRef.трс_УведомлениеОЗавершенииСтроительства</types>
      <types>CatalogRef.трс_КадастровыйПаспорт</types>
      <types>CatalogRef.трс_ВыпискаИзЕГРН</types>
      <types>CatalogRef.трс_СвидетельствоНаПравоСобственности</types>
      <types>CatalogRef.трс_УведомлениеОНачалеСтроительства</types>
      <types>CatalogRef.трс_СвидетельствоОНаследстве</types>
      <types>CatalogRef.трс_РазрешениеНаВводВЭксплуатацию</types>
      <types>CatalogRef.трс_РешениеСобственникаОРазделе</types>
      <types>CatalogRef.трс_ТехническийПаспорт</types>
      <types>CatalogRef.трс_ВыпискаИзИСОГД</types>
      <types>CatalogRef.трс_ПроектРеконструкции</types>
      <types>CatalogRef.трс_МежевойПлан</types>
      <types>CatalogRef.трс_ДополнительноеСоглашение</types>
      <types>CatalogRef.трс_СоглашенияОбУступкеПрав</types>
      <types>CatalogRef.трс_ДоговорДолевогоУчастия</types>
      <types>CatalogRef.трс_ДоговорДарения</types>
      <types>CatalogRef.трс_ТехническоеЗаключение</types>
      <types>CatalogRef.трс_ДоговорМены</types>
      <types>CatalogRef.трс_ДоговорСубаренды</types>
      <types>CatalogRef.трс_ПостановлениеОПредоставленииЗемельногоУчастка</types>
      <types>CatalogRef.трс_ДоговорКуплиПродажи</types>
    </type>
  </attributes>
  <attributes>
    <name>НовыйПравообладатель</name>
    <type>
      <types>CatalogRef.трс_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыбывающийОбъект</name>
    <type>
      <types>CatalogRef.трс_НедвижимоеИмущество</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛиквидацияОбъектаНедвижимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеДокументы</name>
    <attributes>
      <name>ДополнительныйДокумент</name>
      <type>
        <types>CatalogRef.трс_ДоговорЗалога</types>
        <types>CatalogRef.трс_СитуационныйПлан</types>
        <types>CatalogRef.трс_ДоговорАренды</types>
        <types>CatalogRef.трс_АктПриемаПередачи</types>
        <types>CatalogRef.трс_ПисьмоОрганов</types>
        <types>CatalogRef.трс_ТехническийПлан</types>
        <types>CatalogRef.трс_РазрешениеНаСтроительство</types>
        <types>CatalogRef.трс_СхемаРазмещения</types>
        <types>CatalogRef.трс_Декларация</types>
        <types>CatalogRef.трс_ФайловыйДокумент</types>
        <types>CatalogRef.трс_СправкаОКадастровойСтоимости</types>
        <types>CatalogRef.трс_Справка</types>
        <types>CatalogRef.трс_УведомлениеОЗавершенииСтроительства</types>
        <types>CatalogRef.трс_КадастровыйПаспорт</types>
        <types>CatalogRef.трс_ВыпискаИзЕГРН</types>
        <types>CatalogRef.трс_СвидетельствоНаПравоСобственности</types>
        <types>CatalogRef.трс_УведомлениеОНачалеСтроительства</types>
        <types>CatalogRef.трс_СвидетельствоОНаследстве</types>
        <types>CatalogRef.трс_РазрешениеНаВводВЭксплуатацию</types>
        <types>CatalogRef.трс_РешениеСобственникаОРазделе</types>
        <types>CatalogRef.трс_ТехническийПаспорт</types>
        <types>CatalogRef.трс_ВыпискаИзИСОГД</types>
        <types>CatalogRef.трс_ПроектРеконструкции</types>
        <types>CatalogRef.трс_МежевойПлан</types>
        <types>CatalogRef.трс_ДополнительноеСоглашение</types>
        <types>CatalogRef.трс_СоглашенияОбУступкеПрав</types>
        <types>CatalogRef.трс_ДоговорДолевогоУчастия</types>
        <types>CatalogRef.трс_ДоговорДарения</types>
        <types>CatalogRef.трс_ТехническоеЗаключение</types>
        <types>CatalogRef.трс_ДоговорМены</types>
        <types>CatalogRef.трс_ДоговорСубаренды</types>
        <types>CatalogRef.трс_ПостановлениеОПредоставленииЗемельногоУчастка</types>
        <types>CatalogRef.трс_ДоговорКуплиПродажи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Картотека1/src/InformationRegisters/трс_ПереходыОбъектовНедвижимости/трс_ПереходыОбъектовНедвижимости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>трс_ПереходыОбъектовНедвижимости</name>
  <comment>Регистр отслеживает переход объекта недвижимости к разным правообладателям</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НовыйПравообладатель</name>
    <type>
      <types>CatalogRef.трс_Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ПредыдущийПравообладатель</name>
    <type>
      <types>CatalogRef.трс_Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ДокументОснование</name>
    <type>
      <types>CatalogRef.трс_ДоговорЗалога</types>
      <types>CatalogRef.трс_НедвижимоеИмущество</types>
      <types>CatalogRef.трс_СитуационныйПлан</types>
      <types>CatalogRef.трс_ДоговорАренды</types>
      <types>CatalogRef.трс_АктПриемаПередачи</types>
      <types>CatalogRef.трс_ПисьмоОрганов</types>
      <types>CatalogRef.трс_ТехническийПлан</types>
      <types>CatalogRef.трс_РазрешениеНаСтроительство</types>
      <types>CatalogRef.трс_СхемаРазмещения</types>
      <types>CatalogRef.трс_Декларация</types>
      <types>CatalogRef.трс_ФайловыйДокумент</types>
      <types>CatalogRef.трс_СправкаОКадастровойСтоимости</types>
      <types>CatalogRef.трс_Справка</types>
      <types>CatalogRef.трс_УведомлениеОЗавершенииСтроительства</types>
      <types>CatalogRef.трс_КадастровыйПаспорт</types>
      <types>CatalogRef.трс_ВыпискаИзЕГРН</types>
      <types>CatalogRef.трс_СвидетельствоНаПравоСобственности</types>
      <types>CatalogRef.трс_УведомлениеОНачалеСтроительства</types>
      <types>CatalogRef.трс_СвидетельствоОНаследстве</types>
      <types>CatalogRef.трс_РазрешениеНаВводВЭксплуатацию</types>
      <types>CatalogRef.трс_РешениеСобственникаОРазделе</types>
      <types>CatalogRef.трс_ТехническийПаспорт</types>
      <types>CatalogRef.трс_ВыпискаИзИСОГД</types>
      <types>CatalogRef.трс_ПроектРеконструкции</types>
      <types>CatalogRef.трс_МежевойПлан</types>
      <types>CatalogRef.трс_ДополнительноеСоглашение</types>
      <types>CatalogRef.трс_СоглашенияОбУступкеПрав</types>
      <types>CatalogRef.трс_ДоговорДолевогоУчастия</types>
      <types>CatalogRef.трс_ДоговорДарения</types>
      <types>CatalogRef.трс_ТехническоеЗаключение</types>
      <types>CatalogRef.трс_ДоговорМены</types>
      <types>CatalogRef.трс_ДоговорСубаренды</types>
      <types>CatalogRef.трс_ПостановлениеОПредоставленииЗемельногоУчастка</types>
      <types>CatalogRef.трс_ДоговорКуплиПродажи</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектНедвижимости</name>
    <type>
      <types>CatalogRef.трс_НедвижимоеИмущество</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Картотека1/src/Documents/трс_ВыбытиеОбъекта/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр трс_ПереходыОбъектовНедвижимости
	Движения.трс_ПереходыОбъектовНедвижимости.Записывать = Истина;
	Движение = Движения.трс_ПереходыОбъектовНедвижимости.Добавить();
	Движение.Период = Дата;
	Движение.ОбъектНедвижимости = ВыбывающийОбъект;
	Движение.НовыйПравообладатель = НовыйПравообладатель;
	Движение.ПредыдущийПравообладатель = ВыбывающийОбъект.Правообладатель;
	Движение.ДокументОснование = ДокументОснование;
	
	ОбъектСправочника = ВыбывающийОбъект.ПолучитьОбъект();
	ОбъектСправочника.Правообладатель = НовыйПравообладатель;
	ОбъектСправочника.НедвижимостьЛиквидирована = ЛиквидацияОбъектаНедвижимости; 
	// Если мы провели ликвидацию объекта, то он будет помечен как ликвидированный, 
	// но отмена проведения не должна возвращать его из ликвидации, 
	// чтобы это сделать, нужно провести новый документ, с новым правообладателем
	ОбъектСправочника.Записать();

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	трс_ПереходыОбъектовНедвижимости.ПредыдущийПравообладатель КАК ПредыдущийПравообладатель
	               |ИЗ
	               |	РегистрСведений.трс_ПереходыОбъектовНедвижимости КАК трс_ПереходыОбъектовНедвижимости
	               |ГДЕ
	               |	трс_ПереходыОбъектовНедвижимости.Регистратор = &Регистратор";

	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	ПредыдущийПравообладатель = Неопределено;
	Пока Выборка.Следующий() Цикл

		ПредыдущийПравообладатель = Выборка.ПредыдущийПравообладатель;

	КонецЦикла;
	
	Если ЗначениеЗаполнено(ПредыдущийПравообладатель) Тогда
		
		ОбъектСправочника = ВыбывающийОбъект.ПолучитьОбъект();
		ОбъектСправочника.Правообладатель = ПредыдущийПравообладатель;
		ОбъектСправочника.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЗначениеЗаполнено(НовыйПравообладатель) И Не ЛиквидацияОбъектаНедвижимости Тогда
		
		ОбщегоНазначения.СообщитьПользователю(
			"Не заполнен Новый Правообладатель, но объект не ликвидируется",
			ЭтотОбъект,
			"НовыйПравообладатель",
			,
			Отказ
		);
	КонецЕсли;
	
КонецПроцедуры
